//* Обработка ошибок
// обработки ошибок должны информир польз-й о том что происх, для этого примен разные спомобы обработки js
// ошибки могут возник из-за наших промахов, неожиданного ввода пользователя, неправльного ответа сервера и по 1000 др причин

// try ... catch
// для обработки исключений js была представлена конструкция  try ... catch

try {
 // код кот может привести к ошибке
} catch (error) {
    // действия при возникновении ошибки
};

// если в разделе try происх ошибка, выполнение кода немедленно прекращается и возобновляется с раздела catch
// в кот передается объект со сведениями об ошибке
// необязательное предложение finally инструкции try ... catch выполняется после нее в люб случае
// независимо от того, возникла ли ошибка
// ничто в разделе try или catch не может предотвратить выполнение кода в finally
function
try catch

// задача
